lock(document.getElementById('l2'));
lock(document.getElementById('l3'));
lock(document.getElementById('l4'));
lock(document.getElementById('l5'));
var pans="";
var words="Аборт Актер Амвон Ареал Атолл Аврал Алеть Ангар Армяк Агнец Аллюр Аорта Аспид Абзац Акать Амбар Аргон Атлет Авось Акция Ампир Армия Агент Аллея Анчар Аскет Аббат Аймак Альфа Арбуз Атлас Аванс Акциз Ампер Аркан Ахать Агава Аллах Анфас Аршин Азарт Алыча Арабы Атака Абрис Акула Аминь Арест Афиша Автор Алкаш Анонс Архив Адрес Алтын Астра Абрек Актив Амеба Арена Афера Автол Алиби Ангел Архар Адепт Алмаз Апорт АстмаБолид Брасс Будни Бурун Балка Барон Бегом Бивни Бланк Боров Бровь Букли Буфер Бабка Бандо Басок Бекон Биржа Бляха Бочар Бубен Бурав Былье Базар Баржа Бахча Белье Битки Божий Более Брань Будка Бурки Балет Бармы Бдеть Бивак Блажь Борец Брить Букле Бутуз Банда Басня Бекас Бином Блюдо Ботва Брюхо Бульк Былой Бадья Барда Батут Белый Битва Божба Брада Будет Бурка Бювар Балда Барка Башня Бетон Благо Боком Бордо Брешь Букет Бутсы Банан Басма Бейка Билет Блуза Босяк Брюки Булка Быдло Багор Баран Батон Белок Бисер Богач Брага Бугор Бурда Бычок Бакен Барич Башка Берет Битюг Бокал Бонна Бремя Буква Бутон Балык Баски Бедро Бизон Блоха Босой Брысь Булат Бухта Багет Барак Батог Белка Бирюк Бобик Браво Бугай Буран Бытье Байка Барин Бачок Берег Битый Бойня Бомба Брать Будто Бурый Балок Барыш Бегун Бидон Блеск Борть Броня Букса Буфет Багаж Банка Баста Белек Бирка Бобер Бочка Бубны Бурак Бытие Базис Барий Бачки Беляк Битлы БожокВойна Вояка Всяко Выгиб Вьюга Вакса Вбить Везде Ветвь Взлет Витой Внове Волок Врата Вуаль Вызов Валки Вволю Венец Вечно Визит Видео Вклад Вовне Вождь Ворог Врыть Въезд Выпас Ванна Вдеть Верфь Веять Вираж Власы Возок Вотще Всюду Вывоз Вышка Вазон Ваять Вежда Весть Вздох Вития Внизу Волна Враль Втуне Выезд Валка Ввить Велюр Вечер Визир Вишня Вовек Вопль Врозь Вшить Выпад Вальс Вдвое Верба Вещун Виола Влага Вожак Возня Вотум Всход Вывод Вычет Вагон Вахта Ведро Вести Вздор Висок Вмять Волан Враки Втрое Выдра Валик Ввиду Велик Ветла Взять Вихрь Вобла Вольт Вроде Вширь Вынос Валун Вдаль Вепрь Вещий Вилок Вкупе Водка Возле Ворох Вслух Вывих Выход Вафля Вдруг Весна Взвод Виски Влить Вокал Впрок Втора Выдох Вящий Валет Вверх Векша Ветка Взрыв Вихор Внять Волхв Время Вчуже Выкуп Валуй Вдали Венок Вешка Вилла Вкруг Вовсю Возка Ворот Вслед Выбор Вырез Ватка Вдоль Весло Взвар Вирши Влечь Войти Впору Втечь Выгон Вялый Валек Вброд Везти Ветер Взнос Виток Вновь Волос Врать Вчера Выйти Валок Ввысь Веник Вечор Вилка Вкось Вовсе Вожжи Ворон Всего Въявь Выпот Ватин Вдова Верша Вживе Вирус ВлевоГазон Герой Глыба Голье Грань Гряда Галун Гиена Гнуть Гонор Греть Губка Гарус Главк Голец Город Гросс Гурия Газик Гений Глушь Голыш Гранд Грыжа Гюрза Галоп Гидра Гнить Гонка Греко Гуашь Гарем Глава Годок Горло Гроза Гунны Гавот Гелий Глубь Голый Грамм Груша Гусли Галлы Гжель Гниль Гонец Греки Гуано Гараж Гичка Гогот Горка Грипп Гумно Гейша Глист Голос Гофре Грунт Гусем Галка Гетто Гнида Гомон Греза Грязь Гамма Гирло Говор Горец Грива Гуляш Гвалт Глина Голод Гость Грудь Гусар Гайка Гетры Гнать Гольф Графа Грязи Гамак Гипюр Гобой Гопак Греча Гудок Гашиш Гладь Голик Горох Груда ГусакДавка Давно Далее Дамба Дамка Даром Дверь Дебет Дебил Дебит Дебош Дебри Дебют Девиз Девка Деизм Деист Декан Дележ Делец Демон Денди Дерби Десна Десть Детва Детка Дефис Дзюдо Диван Диета Дикий Динар Динго Дичок Длань Длина Длить Днище Добре Добро Довод Догма Дождь Дозор Доить Дойти Докер Долой Домна Домой Домра Донец Донка Донор Донос Доска Досуг Досыл Досье Дотла Доход Дочка Драга Драже Драка Драла Драма Драть Древо Дрейф Дрель Дрема Дробь Дрова Дрога Дроги Дрожь Дрозд Дрофа Дрянь Дубль Дубье Дудка Дужка Дукат Думка Дупло Дурак Дурно Дутый Дутье Духан Душка Душок Дуэль Дыбом Дылда Дымка Дымок Дырка Дышло Дюжий Дюшес Дятел Евнух Евреи Егерь Егоза Едкий Ежели Ежиха Ездка Ездок Езжай Екать Емкий Ересь Есаул Ехать Жабры Жажда Жакан Жакет Жалко Жарок Жатва Жатка Жвала Ждать Желоб Желчь Жених Жердь Жерех Жерло Жесть Жетон Живец Живой Живот Жизнь Жилет Жилец Жилка Жилой Жилье Жираф Житие Житье Жница Жокей Жрать Жулик Жупан Жупел Жучка Жучок Забег Забой Забор Завал Завет Завод Завоз Завуч Загар Загиб Загон Задел Задок Задом Задор Заезд Зажим Зажор Зазор Заика Зайка Зайти Заказ Закал Закат Закон Закут Залеж Залив Залог Залом Замок Замор Замша Занос Запад Запал Запас Запах Запев Запой Запор Зараз Зарез Зарок Заряд Засим Засов Засол Затем Затея Затон Затор Заумь Заход Зачем Зачес Зачет Зачин Звать Звено Зверь Здесь Зебра Зевок Зелье Земля Зенит Зерно Зефир Зимой Зипун Зиять Злато Злеть Злить Злоба Злюка Знамя Знать Зразы Зреть Зубец Зубок Зурна Зыбка Зыбун Иваси Ивняк Игрец Игрок Игрун Идеал Идиот Иерей Ижица Избач Извив Извне Извод Извоз Изгиб Изгой Излет Излом Изъян Изыск Изюбр Икать Икона Икота Иметь Индус Индюк Инжир Иприт Ирбис Искра Искус Ислам Испуг Истец Исток Истый Исход Итого Иудеи Ишиас Кабак Кабан Кагор Кадет Кадка Кадры Кадык Казак Казан Казна Казнь Казус Кайло Кайма Какао Каков Какой Калан Калач Калий Калым Камея Камин Камка Камса Камыш Канал Канат Канва Канон Каноэ Канун Канюк Капля Капор Капот Капут Карат Карга Карий Карст Карта Каска Касса Каста Катар Катер Катет Катод Каток Катыш Качка Кашка Кашне Кашпо Каюта Квант Кварц Квота Кегли Келья Кенаф Кепка Кефир Кзади Кивер Кивок Кизил Кизяк Киоск Кирза Кирка Кисет Кисея Киска Киста Кисть Кичка Кишка Кладь Клака Класс Клерк Клест Клеть Клещи Клика Клише Клоун Клуша Клюка Кляча Кнехт Книга Книзу Князь Кобза Кобра Ковер Когда Кожан Кожух Козел Козлы Козни Койка Койот Кокки Кокон Кокос Колба Колер Колея Колит Колли Колок Колос Колун Колье Кольт Комар Комик Комод Комок Конек Конец Конка Конус Конюх Копер Копия Копна Копун Копыл Копье Коран Корда Кореш Корка Корма Короб Корчи Корье Косец Космы Косой Кость Косяк Котел Котик Кофта Кочан Кочка Кошка Кошма Краги Кража Краля Краса Кредо Креол Крепь Крест Криль Кровь Кроль Кроме Крона Кросс Кроха Круиз Крупа Круча Крыло Крыса Крыть Крыша Кряду Кубик Кубок Кудри Кузен Кузов Кукиш Кукла Кулак Кулан Кулек Кулеш Кулик Кулич Кулон Культ Кумач Кумир Кумыс Кунак Купец Купля Купол Купон Кураж Курды Курия Курок Курсы Кусок Кутеж Куток Кутья Кухня Куцый Кучер Кушак Кювет Лабаз Лаваш Лавка Лавра Ладан Ладья Лазер Лайка Лакей Лампа Лапка Лапта Лапша Ларек Ларец Ласка Лассо Латка Латук Лафит Лаять Лгать Левак Левша Левый Легат Лежак Лежка Лежмя Лезть Лейка Лемех Лемма Лемур Лента Ленца Лепет Лепка Лепта Леска Лесть Летка Леток Летом Летун Леший Лиана Ливер Лидер Ликер Лилия Лиман Лимит Лимон Лимфа Линек Линза Линия Лирик Литер Литой Литье Лихач Лихой Лицей Лишай Лишек Лобби Лобок Ловец Ловля Лодка Ложка Ложок Локон Ломка Лопух Лотос Лохмы Лоция Лошак Лубок Лужок Лузга Лунка Лучок Лыжня Лысый Лычки Лычко Льяло Любой Люнет Люпин Лютик Лютня Лютый Ляжка Лямка Ляпис Мавры Магий Магия Магма Мадам Маета Мажор Мазня Мазок Мазут Майка Майна Майор Макар Макет Макси Малек Малец Малый Малыш Маляр Мамка Манго Манеж Манер Мание Мания Манка Манна Манок Манси Манто Манту Марал Марка Марля Маска Масло Масон Масса Масть Матка Мафия Махра Махры Мачта Медик Медяк Мезга Мелок Менее Мерин Мерка Месса Мести Место Месть Месяц Метан Метил Метис Метка Метла Метод Метро Мечта Мешок Мигом Мидия Милый Минер Минор Минус Миома Мираж Мирра Миска Митра Мишка Млеть Мнить Много Может Можно Мойва Мойка Молва Молот Молох Молча Монах Мопед Морда Мороз Моряк Мосол Мотив Мотка Мотня Моток Мотор Мохер Мочка Мошка Мошна Мразь Мужик Музей Мулат Мулла Муляж Мумие Мумия Мураш Мурка Мусор Муфта Мушка Мчать Мымра Мысик Мысль Мыший Мышка Мышца Мюсли Мякиш Мялка Мямля Мятеж Мятый Набат Набег Набок Набор Навар Навек Навес Навет Навоз Навой Навык Наган Нагар Нагой Нагул Надел Надой Наезд Нажиг Нажим Нажин Назад Назем Назло Найти Наказ Накат Налет Налив Налим Налог Намаз Намек Намет Намыв Нанка Нанос Напев Напор Нарез Народ Нарты Нарыв Наряд Насос Натек Наука Нахал Нация Начес Начет Наяву Наяда Невод Негде Негры Недра Недуг Нейти Некий Некто Немой Немцы Ненцы Нерпа Нести Несть Нетто Нефть Нечто Нивхи Нигде Низок Низом Никак Никто Нимфа Нитка Ничей Ничто Ничья Нищий Новый Ножик Ножка Ножны Номер Норка Норма Норов Носик Носка Носок Ночью Нужда Нулик Нутро Нынче Нырок Нытик Нюанс Оазис Обвал Обвод Обгон Обзор Обида Обить Обком Облик Облом Обман Обмен Образ Обрат Обрез Оброк Обруб Обруч Обрыв Обряд Обувь Обуза Обуть Обход Общий Объем Обыск Овощи Овощь Овраг Овсюг Овчар Огонь Огрех Одежа Одеть Одурь Ожечь Ожить Оземь Озеро Озимь Озноб Окать Океан Окись Оклад Оклик Оковы Около Окрик Окрол Округ Оксид Октет Окунь Олень Олива Олимп Олифа Олово Ольха Омега Омела Омлет Омуль Омыть Оникс Онуча Опала Опара Опека Опера Опись Опить Опиум Оплот Опоек Опока Опора Опрос Оптик Оптом Опять Орава Орало Орать Орган Оргия Орден Ордер Ореол Орлан Орлец Осада Осень Осетр Осина Оскал Ослик Особа Особь Осока Остов Остол Осыпь Отава Отара Отбой Отбор Отвал Отвар Отвес Ответ Отвод Отгон Отгул Отдел Отдых Отель Отечь Отжиг Отзыв Откос Откуп Отлет Отлив Отпор Отрез Отрог Отрок Отруб Отрыв Отряд Отсев Отсек Отток Отход Отцов Отчет Отчий Отчим Отъем Охать Охота Очень Очерк Очник Очный Падеж Падуб Пайка Пакет Пакля Палас Палач Палаш Палех Палец Палка Панда Панна Панно Панты Папка Парад Парез Парик Пария Паром Парта Парус Парча Парша Пасмо Паста Пасти Пасть Пасха Патер Пауза Пафос Пахта Пацан Пачка Пашня Паять Певец Пегас Пегий Пекло Пемза Пенал Пение Пенка Пенни Пепел Перед Перец Перси Перст Персы Песец Песнь Песня Песок Петит Петля Петух Пехом Печка Пеший Пешка Пешня Пиала Пиано Пижон Пикап Пикет Пикша Пилка Пилот Плеер Пинок Пинта Пират Пирог Писец Питон Питье Пихта Пицца Пищик Пламя Пласт Плата Плато Плаун Плаха Плева Племя Плеск Плеть Плечо Плешь Плита Плица Плоть Плыть Пнуть Побег Побои Повал Повар Повод Подле Подол Поезд Пожар Пожня Позер Позже Позор Позыв Поиск Поить Пойло Пойма Пойти Показ Покер Покои Покой Покос Покус Полба Полет Полив Полип Полис Полка Полог Полоз Полок Полон Полый Полюс Помет Помин Помои Помол Помор Помпа Понос Пончо Попка Порез Порей Порка Порог Порой Порок Порох Порою Порты Порча Порыв Посад Посев После Посол Посох Посул Посыл Потек Поток Потом Потоп Поход Почва Почем Почет Почин Почка Почки Почта Почти Пошиб Поэма Право Праща Предо Прель Пресс Преть Прием Прима Принц Причт Приют Проба Проем Проза Просо Прочь Прыть Прядь Пряжа Пряха Птица Пугач Пудра Пузан Пульс Пульт Пупок Пурга Пусть Путем Путик Пучок Пушка Пушок Пущий Пчела Пшено Пытка Пышка Пьеса Пятак Пятка Пятно Пяток Пятый Равно Радар Раджа Радий Радио Радон Разве Разом Разор Разум Район Ралли Рамка Рампа Ранее Ранет Ранец Ранчо Расти Ратай Раунд Рафик Рахит Рация Рачий Рачок Рвань Рвать Рвота Рдеть Ребро Ребус Регби Редис Редут Режим Резак Резец Резка Резня Резон Резус Рейка Рельс Ремиз Рента Репей Ретро Речка Решка Реять Ржать Рикша Ритор Рифма Робот Ровно Ровня Рогач Рогоз Родео Родич Родня Рожок Рожон Розан Розга Розно Рознь Рокот Ролик Роман Рондо Ропак Ропот Ротор Рохля Рояль Ртуть Рубеж Рубец Рубин Рубка Рубль Ругня Ружье Руина Рукав Рулет Рулон Рупия Рупор Русак Русло Русый Ручей Ручка Рыбак Рыбец Рыбий Рывок Рыжий Рында Рынок Рысак Рысий Рысца Рычаг Рэкет Рюмка Рядом Сабля Саван Садик Садок Сазан Сайда Сайка Сайра Сакля Салат Салки Салон Салоп Салют Саман Самбо Самец Самка Самум Самый Санки Сапер Сарай Саржа Сарыч Сатин Сатир Сауна Сахар Сачок Сбить Сбоку Сброд Сбруя Сбыть Свара Сваха Сверх Свеча Свиль Свист Свита Свить Свора Свояк Свыше Связь Сдать Сдача Сдвиг Сдоба Сдуру Сдуть Сеанс Север Седло Седой Седок Сезон Секач Секта Семга Семью Семья Сенаж Сенат Сепия Сербы Серия Серна Серсо Серый Сесть Сетка Сечка Сеять Сжать Сжечь Сжить Сзади Сивка Сивуч Сивый Сидор Сизый Силач Силой Силок Силос Синий Синод Синус Синяк Сирин Сироп Сирый Ситец Ситро Сифон Скала Скань Скарб Сквер Скетч Скирд Скифы Склад Склеп Склон Скоба Сколь Скрип Скука Скула Скунс Слава Слайд Слать Слева Слега Слеза Слива Слизь Слить Слово Слуга Слыть Слышь Слюда Слюна Слюни Смена Смерд Смерч Смесь Смета Сметь Смола Смотр Смочь Смрад Смута Смысл Смыть Смять Снизу Снова Сноха Снять Собес Собор Совет Совка Совок Содом Сойка Сойти Сокол Солод Солон Соляр Сонет Сопка Сопли Сопло Сопля Сорго Сорок Сосед Соска Сосна Сосок Сосуд Сосун Сосцы Сотка Сотня Сотый Софит Сошка Спазм Спать Спесь Спеть Спечь Спина Спирт Сплин Спора Спорт Спрос Спрут Спуск Сразу Среда Среди Средь Сроду Срыть Сряду Ссечь Ссора Ссуда Стадо Сталь Старт Стать Ствол Створ Стезя Стела Стена Стенд Степь Стечь Стиль Стоик Столб Столп Столь Стопа Стояк Страж Страх Стриж Строй Строп Струг Струп Струя Стужа Ступа Стыть Судак Судия Судно Судок Судья Суета Сукно Сумка Сумма Сурик Сурок Сусек Сусло Сутаж Сутки Суфле Сухой Сучка Сучок Сушка Сущий Сфера Схема Сцена Счеты Сшить Съезд Сынок Сырец Сырой Сырок Сырье Сытый Сычуг Сыщик Сюжет Табак Табло Табор Табун Тавро Таган Таить Тайга Тайна Таков Такой Такса Такси Талер Талия Талон Талый Тальк Танго Танец Танин Тапер Тапир Таран Тариф Таска Тафта Тахта Тачка Таять Тварь Твист Театр Тезис Тезка Теизм Текст Телец Телик Телка Телок Тембр Тенек Тенор Тепло Терем Терка Тесак Тесто Тесть Тетка Течка Тиара Типаж Типун Тираж Тиран Тиски Титан Титло Титул Тихий Ткань Ткать Тлеть Товар Тогда Толки Толпа Толща Томат Тонус Топаз Топка Топор Топот Торба Торги Торец Торос Тоска Тотем Точка Тощий Трава Тракт Транс Трата Траур Треба Трель Треск Трест Треть Треух Трефы Триер Трико Тромб Тропа Труба Трусы Труха Тугой Тузик Тулуп Тулья Тумак Туман Тумба Тунец Тупик Тупой Турка Турки Турне Туфли Туфта Тушка Тыква Тычок Тюбик Тюфяк Тяпка Убить Убыль Убыть Увить Уголь Угорь Удаль Удача Удила Удить Уесть Ужели Узина Узкий Узник Уклад Уклон Укора Укроп Уксус Улика Улита Улица Уметь Умник Умный Умора Умыть Умять Унция Унять Упечь Упрек Упырь Усечь Усики Успех Устав Устой Уступ Устье Утеря Утеха Утечь Утиль Утица Утлый Утром Ухарь Ухват Учеба Учить Учхоз Ушить Ушкуй Ушлый Ушник Ушной Ущерб Фазан Фазис Факел Факир Фалда Фальц Фанза Фасад Фаска Фасон Фауна Фаянс Фенил Фенол Ферзь Ферма Феска Фетиш Фиакр Фибра Фижмы Физик Фикус Филей Филер Филин Филон Фильм Финал Финик Финиш Финка Финны Фиорд Фирма Фишка Фланг Флешь Флирт Флокс Флора Фляга Фокус Форма Форум Фраза Фрукт Фугас Фужер Фуляр Фураж Фурия Фурор Халат Халва Халда Халиф Хамса Хамье Ханжа Ханты Хвать Хворь Хвост Херес Хилый Хиляк Химик Химия Хинди Хинин Хиппи Хитон Хлыст Хлюст Хлябь Хмель Хобби Хобот Ходка Ходок Ходом Холка Холод Холоп Холст Холуй Хомут Хомяк Хорал Хорда Хорей Хорек Хором Хохма Хохол Хохот Хруст Худой Хунта Хурал Хурма Хутор Цапка Цапля Цевка Цевье Цедра Целый Центр Цепка Цибик Цикля Цинга Циник Цитра Цифра Цокот Цукат Цуцик Цыпка Цыпки Чайка Чалка Чалма Чалый Чарка Часом Часть Чашка Чаять Чекан Челка Чепец Черви Червь Черед Через Череп Чернь Черта Честь Четки Чехол Чечет Чешки Чешуя Чибис Чижик Чирей Чирок Число Читка Чохом Чрево Чреда Чрезо Чтиво Чтить Чубук Чугун Чудак Чудик Чудом Чужак Чужой Чуйка Чукчи Чулан Чулок Чумак Чурек Чурка Чуток Чутье Чушка Чуять Шабаш Шагом Шайба Шайка Шакал Шалаш Шалун Шалый Шаман Шамот Шанец Шапка Шарах Шарик Шасси Шасть Шатен Шатер Шатия Шатун Шафер Шахта Шашка Шашни Шваль Шведы Шевро Шейка Шелом Шельф Шемая Шепот Шериф Шерпы Шесть Шизик Шинок Шипун Ширма Шитый Шитье Шифер Шифон Шихта Шишак Шишка Шкала Шквал Шкода Школа Шкура Шланг Шлейф Шлюха Шляпа Шмель Шорня Шорох Шорты Шоссе Шофер Шпага Шпала Шпана Шпаты Шпиль Шпион Шпора Шприц Шпунт Шрифт Штамп Штаны Штиль Штифт Штора Шторм Штраф Штрек Штрих Штука Штурм Штырь Шулер Шумок Шурин Шуруп Шутка Щегол Щекот Щелка Щелок Щенок Щепка Щетка Щечка Щипок Щипцы Щиток Щучий Эвены Эклер Экран Элита Эмаль Энный Эпоха Эрзац Эркер Эскиз Эстет Этика Этнос Юркий Юлить Юрист Юкола Юноша Юдоль Юннат Юнкер Юниор Ябеда Явить Явный Ягель Ягода Ягуар Яичко Якобы Якорь Якуты Ямина Ямщик Яркий Ярлык Ярыга Ясень Ясный Яство Ястык Яхонт";
words=words.toUpperCase();
words=words.split(" ");
var awords="Актер Акула Азарт Автор Акция Ангел Атлас Атака Архив Арена Арбуз Агент Арест Армия Атлас Астра Багаж Банан Баран Бекон Берег Букет Буква Броня Белье Белка Бомба Буфет Вагон Валик Ванна Ватка Вафля Венок Взрыв Видео Волос Ветер Вечер Вишня Ведро Весло Визит Весна Вьюга Выход Ворон Волос Гайка Герой Голос Глина Город Горох Грань Гонка Гость Губка Гуашь Грязь Гроза Грань Дверь Диета Диван Длина Досуг Дрова Драка Драма Дуэль Дятел Дрожь Добро Жабры Жетон Жираф Жилет Живот Жизнь Жилье Жажда Жених Жулик Забег Завод Загон Загар Заказ Залив Запас Запах Замок Зебра Зелье Земля Зерно Зефир Знамя Игрок Идеал Инжир Искра Испуг Исход Кабан Казан Казнь Какао Касса Канал Канат Капля Катер Кефир Киоск Кирка Кисть Книга Козел Конец Котел Кофта Кость Кошка Кровь Крест Крупа Крыло Крыса Крыша Кубок Кукла Кулак Кулон Культ Кухня Кусок Купон Лавка Лазер Лампа Лапша Линза Лидер Лилия Лимон Лотос Лодка Лицей Лишай Лямка Магия Малыш Манго Маска Масло Мафия Мачта Медик Метла Мечта Мешок Метка Миска Мопед Мороз Музей Мусор Мятеж Набор Навоз Налог Насос Наука Носок Номер Ножка Оазис Обгон Обмен Образ Обувь Объем Овощь Овраг Огонь Озноб Океан Осень Отдых Отзыв Охота Падеж Пакет Папка Парик Пачка Пенал Перец Песок Петух Петля Пилот Пирог Пихта Пицца Пламя Плеть Повар Пожар Полка Посох Поток Потоп Поход Почва Почта Поэма Пресс Принц Птица Пудра Пчела Пытка Пятно Радар Радио Рамка Раунд Рация Ребро Робот Роман Рояль Ртуть Рубин Ружье Рулет Рулон Ручка Рыбак Рюмка Сабля Салат Салон Салют Сахар Свеча Север Седло Семья Сетка Слива Слизь Слово Сокол Сосед Сосна Спина Спина Спорт Среда Стадо Ствол Столб Страж Стена Сфера Схема Сцена Суфле Тайна Талон Театр Текст Тесто Тесто Ткань Топаз Топор Томат Толпа Товар Тотем Трава Трусы Труба Тропа Туман Тупик Туфли Тюбик Уголь Угорь Удача Укроп Уксус Улица Успех Улика Факел Ферма Филин Фильм Финал Фирма Фокус Фраза Фрукт Форма Халва Халат Хвост Химия Хмель Холод Холст Хруст Цапля Центр Цифра Чайка Чашка Червь Череп Чехол Число Чугун Чешуя Шайба Шаман Шасси Шахта Шашка Шепот Ширма Школа Шторм Шпион Штора Щенок Щетка Щегол Щипцы Эклер Эклер Эпоха Эскиз Юноша Юрист Ягода Ягуар";
awords=awords.toUpperCase();
awords=awords.split(" ");
var k=Math.floor(Math.random()*350);
var ans=awords[k];
var letters=ans;
var str="";
var par=document.getElementsByClassName('strb');
var n=0;
darkmode();
var currow=0;
var strs=document.getElementsByClassName('f1');
function lock(t){	
	var t2=t.childNodes;
	for(var i=0;i<t2.length;i++){
		t2[i].readOnly=true;
	}
}
function unlock(t){	
	var t2=t.childNodes;
	for(var i=0;i<t2.length;i++){
		t2[i].readOnly=false;
	}
}
function letter(e){
	if((e.parentNode.lastChild!=e)&&(e.value!=""))e.nextSibling.focus();
	e.value=e.value.toUpperCase();
}
function checks(d){
	var c=true
	for(var i=0;i<d.length;i++){
		if(d[i].value==""||d[i].value==undefined||d[i].value==null)c=false;
		
	} 
	return c;
}
function newgame(){
	pans=[];
	var t=document.getElementById('h3').childNodes;
	for (var i=0;i<t.length;i++){
		var t2=t[i].childNodes;
		for(var j=0;j<t2.length;j++){
			t2[j].style.color="black";
			t2[j].style.backgroundColor="white";
			t2[j].value="";
		}
	}
	ans=awords[Math.floor(Math.random()*350)];
	letters=ans;
	str="";
	currow=0;
	document.getElementById('l1').firstChild.focus();
	unlock(document.getElementById('l1'));
	for(var i=0;i<par.length;i++)
	{
	var ch=par[i].childNodes;
	for(var j=0;j<ch.length;j++)
		{	if(ch[j].nodeType==1){
				ch[j].style.backgroundColor="white";}
		ch[j].style.color="black";	}	
		}
	}
function press(e){
	var val=e.value;	
	t=strs[currow];
	for(var i=0;i<t.length;i++){
		if(t[i].value==""){
			t[i].value=val;
			break;
		}
	}
}
function Enter(){
	if(checks(strs[currow].childNodes))word(strs[currow].firstChild);
}
function Backspace(){
	t=strs[currow].childNodes;
	var c=-1;
	for(var i=0;i<t.length;i++){
		if(t[i].value!=""){
			c=i;
		}
	}
	if(c!=-1)t[c].value="";
}
function contchange(s){
	for(var i=0;i<par.length;i++)
	{
	var ch=par[i].childNodes;
	for(var j=0;j<ch.length;j++)
		{
			if(ch[j].value==s.value){
				if(ch[j].style.backgroundColor!='rgb(107, 170, 101)'){
				ch[j].style.backgroundColor=s.style.backgroundColor;}
				ch[j].style.color="white";
			}
		}
	}
}

function word(a){
	var c=0;
	var cc=[0,0,0,0,0];
	str="";
	var l=a.parentNode.childNodes;
	var lett=letters;
	for(var i=0;i<l.length;i++){		
		str+=l[i].value;		
	}
	if(words.indexOf(str)>-1&&pans.indexOf(str)==-1){
		pans+=str;
	for(var i=0;i<str.length;i++){
		var s=str[i];
		l[i].style.color="white";
		if(s==ans[i]){
		l[i].style.backgroundColor="#6baa65";		
		c++;
		lett=lett.replace(s,"");
		cc[i]=1;
		contchange(l[i]);
		}
		
	}
	for(var i=0;i<str.length;i++){
		var s=str[i];
		l[i].style.color="white";
		if((lett.search(s)>-1)&&(cc[i]==0)){l[i].style.backgroundColor="#cab357";lett=lett.replace(s,'');contchange(l[i]);}
		else if(cc[i]==0) {l[i].style.backgroundColor="#787f7f";contchange(l[i]);}
	}
	var f=a.parentNode;
	lock(f);
	currow+=1;
	if(c==5){setTimeout(function(){alert("Поздравляем! Вы победили!");newgame();},2000)}
	else if(f.parentNode.lastChild!=f){
	f=f.nextSibling;
	unlock(f);
	f.firstChild.focus();}else{
		setTimeout(function(){alert("К сожалению, вы проиграли!\nЗагаданное слово было: "+ans);newgame();},2000)
	}
	}else if(pans.search(str)!=-1){alert("Вы уже проверяли это слово!");}
	else alert("К сожалению, мы не нашли такого слова в словаре"); 
}
function check(a){
	var l=event.key;
	var r=/[А-Яа-я]/i;
	var d=a.parentNode.childNodes;
	if((event.keyCode=='37')&&(a.parentNode.firstChild!=a)) a.previousSibling.focus();
	if((event.keyCode=='39')&&(a.parentNode.lastChild!=a)) a.nextSibling.focus();
	if((event.keyCode=='13')&&(checks(d))) word(a);
	if((event.keyCode=='8'||(event.keyCode=='46'))) {
		if((a.value=="")&&(a.parentNode.firstChild!=a)){
			a.previousSibling.focus();
			a.previousSibling.value="";
		}else{		
			a.value="";
		}
	}
	if((l.search(r)>-1)){
		if(a.value!="")a.value="";
		event.returnValue= true;
	}else {
		event.returnValue= false;
	}
}
function darkmode(){
	n++;
	if(n%2==1){
	document.getElementById('Bod1').style.backgroundColor="#13141c";
	document.getElementById('h2').style.color="white";
	document.getElementById('h3').style.borderColor="white";
	document.getElementById('h4').style.borderColor="white";}
	else{
	document.getElementById('Bod1').style.backgroundColor="white";
	document.getElementById('h2').style.color="black";
	document.getElementById('h3').style.borderColor="black";
	document.getElementById('h4').style.borderColor="black";	
		
	}
}